In [1]:
import pandas as pd
import numpy as np
import glob

### Reading folder

In [2]:
data=glob.glob(r'F:\Uberdataset'+'\*.csv')

### Appending files

In [3]:
l=[]
for name in data:
    df=pd.read_csv(name)
    l.append(df)
d=pd.concat(l,axis=0,ignore_index=True)

In [4]:
d.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [5]:
d.shape

(4534327, 4)

### Splitting date and time

In [6]:
d['date']=d['Date/Time'].apply(lambda x:x.split(' ')[0])

In [7]:
d['date'].head()

0    4/1/2014
1    4/1/2014
2    4/1/2014
3    4/1/2014
4    4/1/2014
Name: date, dtype: object

### base value_counts

In [8]:
d.Base.value_counts()

B02617    1458853
B02598    1393113
B02682    1212789
B02764     263899
B02512     205673
Name: Base, dtype: int64

In [9]:
d.head()

          Date/Time      Lat      Lon    Base      date
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512  4/1/2014
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512  4/1/2014
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512  4/1/2014
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512  4/1/2014
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512  4/1/2014

### Splitting hour

In [10]:
d['time']=d['Date/Time'].apply(lambda x:x.split(' ')[1])
d['hour']=d['time'].apply(lambda x:x.split(':')[0])

In [11]:
d.head()

          Date/Time      Lat      Lon    Base      date     time hour
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512  4/1/2014  0:11:00    0
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512  4/1/2014  0:17:00    0
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512  4/1/2014  0:21:00    0
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512  4/1/2014  0:28:00    0
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512  4/1/2014  0:33:00    0

### Find Peak hour

In [14]:
d.groupby('hour')['hour'].count().sort_values(ascending=False)

hour
17    336190
18    324679
16    313400
19    294513
20    284604
21    281460
15    275466
22    241858
14    230625
13    195877
7     193094
8     190504
12    170452
23    169190
11    165703
9     159967
10    159148
6     143213
0     103836
5      83939
1      67227
4      55230
3      48287
2      45865
Name: hour, dtype: int64